In [1]:
import pandas as pd
import numpy  as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('E:/Machine Learning/Datasets/Amazon-Movie.csv',index_col=0)

In [3]:
df.head()

,Movie1,Movie2,Movie3,Movie4,Movie5,Movie6,Movie7,Movie8,Movie9,Movie10,...,Movie197,Movie198,Movie199,Movie200,Movie201,Movie202,Movie203,Movie204,Movie205,Movie206
user_id,,,,,,,,,,,,,,,,,,,,,
A3R5OBKS7OM2IR,5.0,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AH3QC2PC1VTGP,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
A3LKP6WPMP9UKX,NaN,NaN,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AVIY68KEPQ5ZD,NaN,NaN,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
A1CV1WROP5KTTW,NaN,NaN,NaN,NaN,5.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
new_df = df.stack().reset_index()

In [5]:
new_df.columns = ['User Id','Movies','ratings']

In [6]:
new_df

             User Id    Movies  ratings
0     A3R5OBKS7OM2IR    Movie1      5.0
1     A3R5OBKS7OM2IR    Movie2      5.0
2      AH3QC2PC1VTGP    Movie3      2.0
3     A3LKP6WPMP9UKX    Movie4      5.0
4      AVIY68KEPQ5ZD    Movie4      5.0
...              ...       ...      ...
4995  A1IMQ9WMFYKWH5  Movie206      5.0
4996  A1KLIKPUF5E88I  Movie206      5.0
4997   A5HG6WFZLO10D  Movie206      5.0
4998  A3UU690TWXCG1X  Movie206      5.0
4999   AI4J762YI6S06  Movie206      5.0

[5000 rows x 3 columns]

In [7]:
new_df.describe().T

          count    mean       std  min  25%  50%  75%  max
ratings  5000.0  4.3856  1.199667  1.0  4.0  5.0  5.0  5.0

Which movies have maximum views?

In [8]:
new_df.groupby('Movies').count().reset_index().sort_values(ascending=False,by='ratings')[:1]

      Movies  User Id  ratings
31  Movie127     2313     2313

Which movies have maximum ratings?

In [9]:
new_df.groupby('Movies').sum().reset_index().sort_values(ascending=False,by='ratings')[:1]

      Movies  ratings
31  Movie127   9511.0

What is the average rating for each movie? Define the top 5 movies with the maximum ratings

In [10]:
new_df.groupby('Movies').mean().reset_index().sort_values(ascending=False,by='ratings')[:5]

       Movies  ratings
0      Movie1      5.0
159   Movie57      5.0
96   Movie186      5.0
93   Movie183      5.0
91   Movie181      5.0

Define the top 5 movies with the least audience

In [11]:
new_df.groupby('Movies').count().reset_index().sort_values(by='ratings')[:5]

      Movies  User Id  ratings
0     Movie1        1        1
138  Movie38        1        1
142  Movie41        1        1
143  Movie42        1        1
146  Movie45        1        1

In [12]:
from surprise import Reader,Dataset

In [13]:
rd = Reader()
data = Dataset.load_from_df(new_df,reader=rd)

In [14]:
data.df.head()

          User Id  Movies  ratings
0  A3R5OBKS7OM2IR  Movie1      5.0
1  A3R5OBKS7OM2IR  Movie2      5.0
2   AH3QC2PC1VTGP  Movie3      2.0
3  A3LKP6WPMP9UKX  Movie4      5.0
4   AVIY68KEPQ5ZD  Movie4      5.0

In [15]:
from surprise.model_selection import train_test_split

In [16]:
trainset, testset = train_test_split(data,test_size=0.20)

In [17]:
from surprise import SVD

In [18]:
svd = SVD()

In [19]:
svd.fit(trainset)

In [20]:
pred = svd.test(testset)

In [21]:
from surprise import accuracy

In [22]:
accuracy.rmse(pred)

RMSE: 1.1467

1.146705693023633

In [24]:
accuracy.mae(pred)

MAE:  0.8508

0.8508004471123417

In [25]:
from surprise.model_selection import cross_validate

In [26]:
result = cross_validate(svd, data, measures = ['RMSE', 'MAE'], cv = 3, verbose = True)

Evaluating RMSE, MAE of algorithm SVD on 3 split(s).

                  Fold 1  Fold 2  Fold 3  Mean    Std
RMSE (testset)    1.1559  1.1876  1.1366  1.1600  0.0210
MAE (testset)     0.8345  0.8536  0.8581  0.8487  0.0102
Fit time          0.28    0.25    0.25    0.26    0.01
Test time         0.01    0.01    0.06    0.03    0.02

In [27]:
print(result['test_rmse'].mean())

1.1600254462464867